const stepsData = [
  { id: 1, title: `מערכת החינוך`, text: `מערכת החינוך החרדית נתפסת כ"ציפור הנפש" של החברה, שבה מוטמעים ערכי הליבה של החברה החרדית. ילדים מתחילים ללמוד מגיל 3 ועד למעשה, לנישואין`, textInCircle: "מערכת החינוך" },
  { id: 2, title: `חינוך אצל הבנים והבנות בחברה החרדית`, text: `בנים עד כיתה ח' - לומדים ב"חיידר" כמעט ללא לימודי ליבה בכיתות ט'-י"ב - לימודי קודש בלבד בישיבה "קטנה"וכיתות י"ג עד הנישואין - לימודי קודש בלבד בישיבה "גדולה אצל הבנות מכיתה א' עד י"ב הן לומדות לימודי קודש מוגברים ולימודי ליבה מלאה, במתכונת המקבילה ללימודי בגרות."`, textInCircle: "בנים/בנות" },
  { id: 3, title: `מנהיגות רוחנית / רבנית בחברה החרדית:`, text:`ככלל, בחברה החרדית הדמויות המובילות בכל תחומי החיים הינן גדולי הדור, רבנים ואדמורים.לאחרונה יש ביזור בהנהגה ולצד ההנהגה הארצית מתפתחת הנהגה גם בדרגי הביניים ובקהילות.` , textInCircle: "מנהיגות רוחנית / רבנית" },
  { id: 4, textInCircle: "בהיבט הפוליטי" },
  { id: 5, title: 'אנשי החצר', text:`ככלל, בחברה החרדית הדמויות המובילות בכל תחומי החיים הינן גדולי הדור, רבנים ואדמורים.לאחרונה יש ביזור בהנהגה ולצד ההנהגה הארצית מתפתחת הנהגה גם בדרגי הביניים ובקהילות.`, textInCircle: 'העסקנות הקהילתית או "אנשי החצר"' },
  { id: 6, title: `דרג מקצועי`, text: `לאחרונה מתפתחת שכבה חדשה של דרג מקצועי, הנמצאת במגמת צמיחה, ומהווה גשר בין החברה הכללית לחברה החרדית. כאן ישנם גברים ונשים משכילים, בעלי מקצועות חופשיים, ממעמד ביניים כלכלי/חברתי.`, textInCircle: "דרג מקצועי" },

];

export default stepsData;
