
const stepsData = {
  "החברה החרדית": [
    { id: 1, title: `מערכת החינוך`, text: `מערכת החינוך החרדית נתפסת כ"ציפור הנפש" של החברה, שבה מוטמעים ערכי הליבה של החברה החרדית. ילדים מתחילים ללמוד מגיל 3 ועד למעשה, לנישואין`, textInCircle: "מערכת החינוך" },
    { id: 2, title: `חינוך אצל הבנים והבנות בחברה החרדית`, text: `בנים עד כיתה ח' - לומדים ב"חיידר" כמעט ללא לימודי ליבה. בכיתות ט'-י"ב - לימודי קודש בלבד בישיבה "קטנה". כיתות י"ג עד הנישואין - לימודי קודש בלבד בישיבה "גדולה". אצל הבנות מכיתה א' עד י"ב הן לומדות לימודי קודש מוגברים ולימודי ליבה מלאה, במתכונת המקבילה ללימודי בגרות.`, textInCircle: "בנים/בנות" },
    { id: 3, title: `מנהיגות רוחנית / רבנית בחברה החרדית:`, text: `ככלל, בחברה החרדית הדמויות המובילות בכל תחומי החיים הינן גדולי הדור, רבנים ואדמורים. לאחרונה יש ביזור בהנהגה ולצד ההנהגה הארצית מתפתחת הנהגה גם בדרגי הביניים ובקהילות.`, textInCircle: "מנהיגות רוחנית / רבנית" },
    { id: 4, textInCircle: "בהיבט הפוליטי", title: 'בהיבט הפוליטי', text: 'כל מגזר בחברה החרדית מזוהה עם מפלגה פוליטית, וממונה על ידי ההנהגה הרוחנית של "מועצת גדולי התורה" ולפי המפתחות של מוקדי הכוח בקהילה. גררי את המגזר למפלגה המתאימה.'},
    { id: 5, title: 'העסקנות הקהילתית או "אנשי החצר"', text:`ככלל, בחברה החרדית הדמויות המובילות בכל תחומי החיים הינן גדולי הדור, רבנים ואדמורים.לאחרונה יש ביזור בהנהגה ולצד ההנהגה הארצית מתפתחת הנהגה גם בדרגי הביניים ובקהילות.`, textInCircle: 'אנשי החצר' },
    { id: 6, title: `דרג מקצועי`, text: `לאחרונה מתפתחת שכבה חדשה של דרג מקצועי, הנמצאת במגמת צמיחה, ומהווה גשר בין החברה הכללית לחברה החרדית. כאן ישנם גברים ונשים משכילים, בעלי מקצועות חופשיים, ממעמד ביניים כלכלי/חברתי.`, textInCircle: "דרג מקצועי" },
  ],
  "החברה הערבית": [
    { id: 1, title: ` מנהיגות החברה הערבית:`, text: `החברה הערבית בישראל מאופיינת במבנה מנהיגותי מגוון, הכולל מספר מוקדי הנהגה הפועלים במקביל ומשפיעים על חיי הקהילה והציבור.`, textInCircle: "מנהיגות החברה הערבית " },
    { id: 2, title: `מנהיגות החברה הערבית:`, text:``, textInCircle: `מנהיגות החברה הערבית` },
    { id: 3, title: ` החברה הערבית בחרבות ברזל:    `, text: `במהלך מלחמת חרבות ברזל התמודדה החברה הערבית בישראל עם מציאות מורכבת, בדומה לחברה הישראלית כולה, אך מתוך מאפיינים ייחודיים לה. לצד חשיפה לאיומים ביטחוניים, בעיקר ביישובים בצפון ובערים מעורבות, התחדדו גם מתחים חברתיים ותחושות של חוסר ודאות. במקביל, ניכרו מאמצים לשמירה על שגרה קהילתית, חיזוק מערכות תמיכה פנימיות והמשך פעילות של רשויות מקומיות, ארגוני חברה אזרחית וגורמי חירום. המלחמה הדגישה את חשיבות הנגשת המידע, בניית אמון עם מוסדות המדינה, וחיזוק שיתופי פעולה אזרחיים ומוניציפליים, כחלק מהתמודדות משותפת עם אתגרי החירום והשפעתם על כלל אזרחי המדינה.`, textInCircle: "   החברה בחרבות ברזל " },
  ],
  "מוגבלויות והגיל השלישי": [
    { id: 1, title: ` התמודדות עם הפרעה פסיכיאטרית`, text: `בואו נצלול לעולם הרגיש והמורכב של התמודדות עם הפרעה פסיכיאטרית:מדובר בקבוצת הנכות הגדולה ביותר בביטוח הלאומי – בפער ניכר.כ־4% מהמבוגרים ו־2% מהילדים בישראל מתמודדים עם משבר נפשי משמעותי, שיכול להתפתח למגבלה חמורה. הזו נחלקת לשניים:הפרעות פסיכיאטריות אורגניות ופסיכוטיות – כמו סכיזופרניה ונפגעי סמים.הפרעות מצב רוח, דחק ואישיות.ברוב המקרים, המתמודדים נשמעים להנחיות - גם בחירום. אבל במצב חירום מתמשך, החוסן שלהם נשחק, ועלולה להתפתח תגובה פוסט טראומטית.כאן נכנסים לתמונה כלים ראשוניים – כמו מודל מעש"ה, ונטילציה, ועוד.`, textInCircle: "הפרעה פסיכיאטרית " },
    { id: 2, title: `מגבלה שכלית-התפתחותית`, text: `דמיינו ילד או מבוגר שמתקשה להבין או לזכור הוראות, הפשטה, פתרון בעיות פשוטות, או הבנת מצבים חברתיים. פעולות יומיומיות כמו בישול, ניקיון או שימוש בתחבורה ציבורית – עלולות להפוך לאתגר.לכן יש לשים לב למסרים עם פישוט לשוני, אוצר מילים בסיסי, משפטים קצרים וברורים, התמקדות במידע העיקרי, ברצף הגיוני – אלו המפתחות להבנה ולשיתוף פעולה.`, textInCircle: "מגבלה שכלית-התפתחותית " },
    { id: 3, title: ` בעולם של ילדים עם מוגבלות`, text: `אוטיזם היא הפרעה בהתפתחות התקינה של הילד. היא לא "מחלה" אלא קשת של מאפיינים שכולם נוגעים ליכולת של הילד להסתגל לסביבה חברתית ולייצר בה קשרים עם אחרים.ילדים עם אוטיזם יכולים להיות רגישים לרעש, להתקשות ביוזמה ובקבלת החלטות, ולחוות רמות חרדה גבוהות. יתכנו גם קשיים בהכללה, העדר ספונטניות, הפרעות בשינה ובאכילה, עם הפרעות נוירו התפתחותיות ופסיכיאטריות אחרות.כיום, כ־125,000 ילדים זכאים לקצבת נכות מביטוח לאומי.לכן כדי לעזור להם -חשוב לדבר בצורה ישירה, לא מופשטת – ובגובה העיניים. לא עליהם, לא מעליהם – אלא איתם.`, textInCircle: "  ילדים עם מוגבלות" },
    { id: 4, title: ` ומה עם מוגבלות בתנועה?`, text: `הנגישות במרחב הציבורי בכלל ואמצעי מיגון בפרט בישראל, אינם ברמה מספקת. איכות הנגישות לחירום תלויה בהכנה מוקדמת. יכולת הפינוי של מוגבלים מוטורית דורשת תכנון וסיוע בעיקר למתניידים על כיסאות גלגלים.על פי משרד הבריאות, כ־100 אלף איש מתניידים בכיסאות גלגלים – קבועים או זמניים.הסיבות מגוונות: ממחלות מולדות, נוירולוגיות ועד לתאונות שונות.לכן נדרשת הכנה מראש ותכנון מוקפד.`, textInCircle: " מוגבלות בתנועה" },
    { id: 5, title: `בואו נחדד את סוגיית המגבלות החושית:`, text: `בישראל לשנת 2026 יש 45,000 אנשים עם לקויות שמיעה בדרגות שונות. אוכלוסייה זאת מגלה קושי בקבלת התרעה המבוססת על קול ולכן נדרשת הנגשה של התרעות באמצעים חזותיים, טכנולוגים וטקסטואליים מותאמים`, textInCircle: " המגבלות החושית" },
    { id: 6, title: ` ומה עם לקויות ראייה?`, text: `כ- 27,000 אנשים זכאים לתעודת עיוור עקב עיוורון מוחלט.זיכרו כי אנשים עיוורים זקוקים להכנות רבות על מנת להתאים מרחב מוגן בטוח.`, textInCircle: "לקויות ראייה" },
  ]
};


export default stepsData;
