const trueFalseData = {
  'החברה החרדית': [
    { 
      statement:`החברה החרדית מתחלקת לשלושה מגזרים פנימיים עיקריים: הליטאים, החסידים והספרדים.`,
      correct: 'true',
      feedback: {
        correct: `תשובה נכונה, זו אמת, החברה החרדית מתחלקת למגזרים פנימיים, בערך באופן שווה - שליש ליטאים, שליש חסידים ושליש ספרדים.`,
        wrong: ` המשפט אמת, החברה החרדית מתחלקת למגזרים פנימיים, בערך באופן שווה - שליש ליטאים, שליש חסידים ושליש ספרדים.`
      }
    },
        { 
      statement:`מקור השם "הליטאי" קשור לבית כנסת בעיר אומן המאופיין בריקודים ושמחה סביב הרבנים כערך עליון.`,
      correct: 'false',
      feedback: {
        wrong: ` המשפט מיתוס, מקור השם "הליטאים" נגזר מהשתייכות לאופיין של ישיבות ליטא מאמצע המאה ה-19. הליטאים מתאפיינים בלימוד תורה כערך עליון, ולרוב הולכים אחרי מנהיג מרכזי יחיד המכונה "גדול הדור"`,
        correct: `תשובה נכונה, המשפט מיתוס, מקור השם "הליטאים" נגזר מהשתייכות לאופיין של ישיבות ליטא מאמצע המאה ה-19.הליטאים מתאפיינים בלימוד תורה כערך עליון, ולרוב הולכים אחרי מנהיג מרכזי יחיד המכונה "גדול הדור".`
      }
    },
        { 
      statement:`"הפלג הירושלמי" היא הקבוצה הגדולה ביותר בזרם הליטאי`,
      correct: 'false',
      feedback: {
        wrong: ` המשפט מיתוס, תת קבוצה בתוך הליטאים נקראת "הפלג הירושלמי" או "עץ". זו קבוצה קיצונית בכל הקשור לשירות צבאי אך מהווה כ- 15% מהחברה הליטאית.`,
        correct: `תשובה נכונה, המשפט מיתוס, תת קבוצה בתוך הליטאים נקראת "הפלג הירושלמי" או "עץ". זו קבוצה קיצונית בכל הקשור לשירות צבאי אך מהווה כ- 15% מהחברה הליטאית.`
      }
    },
        { 
      statement:`"עושה חסד ונוהג באהבה וברחמים" מהמקורות, מיוחס למייסד תנועת החסידות`,
      correct: 'true',
      feedback: {
        correct: `תשובה נכונה, זו אמת, "עושה חסד ונוהג באהבה וברחמים" מהמקורות, מיוחס למייסד תנועת החסידות, הבעל שם טוב, מאמצע המאה ה-18. `,
        wrong: ` המשפט אמת, "עושה חסד ונוהג באהבה וברחמים" מהמקורות, מיוחס למייסד תנועת החסידות, הבעל שם טוב, מאמצע המאה ה-18. `
      }
    },
        { 
      statement:`החסידים מחולקים לזרמים רבים, ומה שמאפיין אותם זו השמחה.`,
      correct: 'true',
      feedback: {
        correct: `תשובה נכונה, זו אמת, החסידים מחולקים לזרמים רבים, דוגמאת גור, ויזניץ בעלז ועוד, כשלכל זרם - אדמו"ר ומנהיג. החסידים מתאפיינים בערך השמחה והחיבור לצדיק כערך עליון וללימודי התורה, ולקהילתיות המקיפה את כל מעגלי החיים.`,
        wrong: ` המשפט אמת, החסידים מחולקים לזרמים רבים, דוגמאת גור, ויזניץ בעלז ועוד, כשלכל זרם - אדמו"ר ומנהיג. החסידים מתאפיינים בערך השמחה והחיבור לצדיק כערך עליון וללימודי התורה, ולקהילתיות המקיפה את כל מעגלי החיים.`
      }
    },
        { 
      statement:`החסידים אינם פוגשים את האדמו"ר אלא באירועים מיוחדים.`,
      correct: 'false',
      feedback: {
        wrong: ` המשפט מיתוס, הקהילה פוגשת את האדמו"ר מדי שבת וחג ב"טיש", וכן במסגרת התייעצות אישית - קוויטל, בה מתייעצים על נושאים מחיי היומיום.`,
        correct: `תשובה נכונה, המשפט מיתוס, הקהילה פוגשת את האדמו"ר מדי שבת וחג ב"טיש", וכן במסגרת התייעצות אישית - קוויטל, בה מתייעצים על נושאים מחיי היומיום.`
      }
    },
        { 
      statement:`ה"ספרדים" הם שלישי מהחברה החרדית, השם מגיע ממוצא ארצות האיסלאם.`,
      correct: 'true',
      feedback: {
        correct: `תשובה נכונה, זו אמת, מקור השם "ספרדי" נגזר מארצות האיסלאם, משם מוצאם של אנשי המגזר.`,
        wrong: ` המשפט אמת, מקור השם "ספרדי" נגזר מארצות האיסלאם, משם מוצאם של אנשי המגזר.`
      }
    },
        { 
      statement:`באופן כללי, החרדי הספרדי חי אורך חיים ואופי ישיבה הדומה למגזר החסידי.`,
      correct: 'false',
      feedback: {
        wrong: ` המשפט מיתוס, באופן כללי אורך החיים ואופי הישיבה הספרדי דומה יותר למגזר הליטאי, אם כי היציאה לעבודה נמצאת במספרים גדולים יותר בקרב הספרדים.`,
        correct: `תשובה נכונה, המשפט מיתוס, באופן כללי אורך החיים ואופי הישיבה הספרדי דומה יותר למגזר הליטאי, אם כי היציאה לעבודה נמצאת במספרים גדולים יותר בקרב הספרדים.`
      }
    },
        { 
      statement:`רוב מוחלט מהחוזרים בתשובה נמצאים בעיקר בקרב השליש הספרדי.`,
      correct: 'true',
      feedback: {
        correct: `תשובה נכונה, זו אמת, החוזרים בתשובה מגיעים לרוב מקבוצה זו - הספרדים.`,
        wrong: `המשפט אמת, החוזרים בתשובה מגיעים לרוב מקבוצה זו - הספרדים.`
      }
    },
        { 
      statement:`כל החרדים מתלבשים אותו דבר.`,
      correct: 'false',
feedback: {
  wrong: `המשפט מיתוס, הליטאי לבוש בחליפה קצרה עם מגבעת תואמת ופאות מאחורי האוזניים.<br />
החסיד לבוש חליפה ארוכה, מגבעת עגולה ושטריימל בשבת, ופאותיו מסולסלות.<br />
הספרדי לבוש (בדומה למגזר הליטאי) בחליפה קצרה עם מגבעת תואמת.`,
  correct: `תשובה נכונה, המשפט מיתוס, הליטאי לבוש בחליפה קצרה עם מגבעת תואמת ופאות מאחורי האוזניים.<br />
החסיד לבוש חליפה ארוכה, מגבעת עגולה ושטריימל בשבת, ופאותיו מסולסלות.<br />
הספרדי לבוש (בדומה למגזר הליטאי) בחליפה קצרה עם מגבעת תואמת.`
}
    },

  ],

  'החברה הערבית': [
    {
      statement: 'החברה הערבית בישראל מהווה כ־10% מכלל אוכלוסיית המדינה, ומונה כמיליון אזרחים.',
      correct: 'false',
      feedback: {
        wrong: 'המשפט מיתוס, החברה הערבית בישראל מהווה כ־21% מכלל אוכלוסיית המדינה, ומונה למעלה משני מיליון אזרחים .',
        correct: 'תשובה נכונה, המשפט מיתוס, החברה הערבית בישראל מהווה כ־21% מכלל אוכלוסיית המדינה, ומונה למעלה משני מיליון אזרחים.'
      }
    },
    {
      statement: `מדובר בקבוצה מגוונת הכוללת מוסלמים, נוצרים, דרוזים וקבוצות נוספות, עם מאפיינים תרבותיים, דתיים וחברתיים שונים.`,
      correct: 'true',
      feedback: {
        correct: `תשובה נכונה, זו אמת, מדובר בקבוצה מגוונת הכוללת מוסלמים, נוצרים, דרוזים וקבוצות נוספות, עם מאפיינים תרבותיים, דתיים וחברתיים שונים .`,
        wrong: `המשפט אמת, מדובר בקבוצה מגוונת הכוללת מוסלמים, נוצרים, דרוזים וקבוצות נוספות, עם מאפיינים תרבותיים, דתיים וחברתיים שונים.`
      }
    },
    {
      statement: 'ריכוזי האוכלוסייה הערבית נמצאים בצפון הארץ – בגליל ובמשולש, ביישובים כמו נצרת, אום אל־פחם, שפרעם, טייבה ובאקה־ג’ת, וכן במזרח ירושלים. בנוסף, קיימות ערים מעורבות כגון חיפה, עכו, יפו, רמלה ולוד, שבהן חיים יהודים וערבים זה לצד זה',
      correct: 'true',
      feedback: {
        correct: 'תשובה נכונה, זו אמת, ריכוזי האוכלוסייה הערבית נמצאים בצפון הארץ – בגליל ובמשולש, ביישובים כמו נצרת, אום אל־פחם, שפרעם, טייבה ובאקה־ג’ת, וכן במזרח ירושלים. בנוסף, קיימות ערים מעורבות כגון חיפה, עכו, יפו, רמלה ולוד, שבהן חיים יהודים וערבים זה לצד זה',
        wrong: 'המשפט אמת, ריכוזי האוכלוסייה הערבית נמצאים בצפון הארץ – בגליל ובמשולש, ביישובים כמו נצרת, אום אל־פחם, שפרעם, טייבה ובאקה־ג’ת, וכן במזרח ירושלים. בנוסף, קיימות ערים מעורבות כגון חיפה, עכו, יפו, רמלה ולוד, שבהן חיים יהודים וערבים זה לצד זה'
      }
    },
    {
      statement: 'החברה הערבית מתחלקת על פני הארץ -51% אחוזים מתגוררים בצפון הארץ,17% מתגוררים באיזור הנגב וקצת יותר משמונה אחוזים מתגוררים בערים מעורבות (כמו לוד, רמלה, חיפה ועכו).',
      correct: 'true',
      feedback: {
        correct: 'תשובה נכונה, זו אמת, החברה הערבית מתחלקת על פני הארץ -51% אחוזים מתגוררים בצפון הארץ,17% מתגוררים באיזור הנגב וקצת יותר משמונה אחוזים מתגוררים בערים מעורבות (כמו לוד, רמלה, חיפה ועכו).',
        wrong: 'המשפט אמת, החברה הערבית מתחלקת על פני הארץ -51% אחוזים מתגוררים בצפון הארץ,17% מתגוררים באיזור הנגב וקצת יותר משמונה אחוזים מתגוררים בערים מעורבות (כמו לוד, רמלה, חיפה ועכו).'
      }
    },
    {
      statement: 'ניתן גם לחלק את האוכלוסייה לפי שיוך דתי:83% מהחברה הערבית הינם מוסלמים, 9% דרוזים ו-8% מהחברה הם נוצרים ',
      correct: 'true',
      feedback: {
        correct: 'תשובה נכונה, זו אמת, ניתן גם לחלק את האוכלוסייה לפי שיוך דתי:83% מהחברה הערבית הינם מוסלמים, 9% דרוזים ו-8% מהחברה הם נוצרים ',
        wrong: 'המשפט אמת, ניתן גם לחלק את האוכלוסייה לפי שיוך דתי:83% מהחברה הערבית הינם מוסלמים, 9% דרוזים ו-8% מהחברה הם נוצרים '
      }
    }
  ],

  'מוגבלויות והגיל השלישי': [
    {
      statement: `בישראל חיים למעלה ממיליון אנשים עם מוגבלויות, המהווים כ־10–11% מהאוכלוסייה.`,
      correct: 'true',
      feedback: {
        correct: `תשובה נכונה, זו אמת, בישראל חיים למעלה ממיליון אנשים עם מוגבלויות, המהווים כ־10–11% מהאוכלוסייה, כאשר בפועל שיעור האנשים החווים מוגבלות כלשהי במהלך חייהם גבוה אף יותר. `,
        wrong: `המשפט אמת, בישראל חיים למעלה ממיליון אנשים עם מוגבלויות, המהווים כ־10–11% מהאוכלוסייה, כאשר בפועל שיעור האנשים החווים מוגבלות כלשהי במהלך חייהם גבוה אף יותר. `
      }
    },
    {
      statement: `האוכלוסייה בגיל 65 ומעלה נמצאת בירידה מתמדת.`,
      correct: 'false',
      feedback: {
        wrong: `המשפט מיתוס, האוכלוסייה בגיל 65 ומעלה בישראל נמצאת במגמת גידול מתמדת.`,
        correct: `תשובה נכונה, המשפט מיתוס, האוכלוסייה בגיל 65 ומעלה בישראל נמצאת במגמת גידול מתמדת.`
      }
    },
    {
      statement:`כל האנשים עם מוגבלויות מוגבלים פיזית ומתניידים בכיסא גלגלים.`,
      correct: 'false',
      feedback: {
        wrong: `המשפט מיתוס, אנשים עם מוגבלויות כוללים מגוון רחב של מצבים: מוגבלויות פיזיות, חושיות, קוגניטיביות ונפשיות.`,
        correct: `תשובה נכונה, המשפט מיתוס, אנשים עם מוגבלויות כוללים מגוון רחב של מצבים: מוגבלויות פיזיות, חושיות, קוגניטיביות ונפשיות.`
      }
    },
    {
      statement: `לכל בעלי המוגבלויות יש צורך בסביבה נגישה, מותאמת ומכילה, המאפשרת השתתפות פעילה בחיים האישיים, החברתיים והקהילתיים.`,
      correct: 'true',
      feedback: {
        correct: `תשובה נכונה, זו אמת, לכל סוג מוגבלות צרכים שונים, אך המשותף לכולם הוא הצורך בסביבה נגישה, מותאמת ומכילה, המאפשרת השתתפות פעילה בחיים האישיים, החברתיים והקהילתיים.`,
        wrong: `המשפט אמת, לכל סוג מוגבלות צרכים שונים, אך המשותף לכולם הוא הצורך בסביבה נגישה, מותאמת ומכילה, המאפשרת השתתפות פעילה בחיים האישיים, החברתיים והקהילתיים.`
      }
    },
    {
      statement: `האוכלוסייה המבוגרת בישראל זקוקה כולה לסיוע יומיומי`,
      correct: 'false',
      feedback: {
        wrong: `המשפט מיתוס, האוכלוסייה המבוגרת בישראל כוללת אנשים עצמאיים ופעילים לצד כאלה הזקוקים לסיוע יומיומי, שירותי בריאות, תרופות וליווי.`,
        correct: `תשובה נכונה, המשפט מיתוס, האוכלוסייה המבוגרת בישראל כוללת אנשים עצמאיים ופעילים לצד כאלה הזקוקים לסיוע יומיומי, שירותי בריאות, תרופות וליווי.`
      }
    },
    {
      statement: `רבים מהקשישים גרים לבדם, חלקם תלויים במערכות הרווחה, בני משפחה או מטפלים.`,
      correct: 'true',
      feedback: {
        correct: `תשובה נכונה, זו אמת, מרבית בני ובנות הגיל השלישי אינם נזקקים לסיוע, חלקם, תלויים במערכות הרווחה, בני משפחה או מטפלים. `,
        wrong: `המשפט אמת, מרבית בני ובנות הגיל השלישי אינם נזקקים לסיוע, חלקם, תלויים במערכות הרווחה, בני משפחה או מטפלים. `
      }
    },
  ]
};

export default trueFalseData;
