const trueFalseData = {
  'החברה החרדית': [
    { 
      statement: 'החברה החרדית היא אחת הקבוצות המשמעותיות והצומחות ביותר בחברה הישראלית. כיום מונה האוכלוסייה החרדית כ־14% מכלל תושבי המדינה', 
      correct: 'true',
      feedback: {
        correct: 'נכון! נוסף על כך החברה החרדית מונה למעלה ממיליון וארבע מאות אלף איש. שיעור זה נמצא במגמת עלייה מתמדת, ונחשב לאחד ממנועי הצמיחה הדמוגרפיים המרכזיים בישראל.',
        wrong: 'החברה החרדית היא אחת הקבוצות המשמעותיות והצומחות ביותר בחברה הישראלית. כיום מונה האוכלוסייה החרדית כ־14% מכלל תושבי המדינה, למעלה ממיליון וארבע מאות אלף איש . שיעור זה נמצא במגמת עלייה מתמדת, ונחשב לאחד ממנועי הצמיחה הדמוגרפיים המרכזיים בישראל'
      }
    },
    { 
      statement: 'החברה החרדית אינה מקשה אחת. היא כוללת זרמים ותתי־קהילות שונות, בהן ליטאים, חסידים וספרדים, שלכל אחת מהן מאפיינים תרבותיים וקהילתיים ייחודיים.', 
      correct: 'true',
      feedback: {
        correct: 'נכון! עם זאת, קיים מכנה משותף רחב המתבסס על מחויבות עמוקה להלכה היהודית, לאורח חיים דתי ולשמירה על מסורת.',
        wrong: 'לא נכון. החברה החרדית אינה מקשה אחת. היא כוללת זרמים ותתי־קהילות שונות, בהן ליטאים, חסידים וספרדים, שלכל אחת מהן מאפיינים תרבותיים וקהילתיים ייחודיים. עם זאת, קיים מכנה משותף רחב המתבסס על מחויבות עמוקה להלכה היהודית, לאורח חיים דתי ולשמירה על מסורת.'
      }
    },
    { 
      statement: 'מבנה האוכלוסייה החרדית צעיר במיוחד. למעלה ממחצית מהאוכלוסייה הם ילדים ובני נוער, ושיעור הילודה גבוה משמעותית מהממוצע הארצי.', 
      correct: 'true',
      feedback: {
        correct: 'נכון! נתון זה משפיע על אופי החיים בקהילה, על מבנה המשפחה, ועל הצרכים בתחומי חינוך, רווחה ושירותים קהילתיים.',
        wrong: 'לא נכון. מבנה האוכלוסייה החרדית צעיר במיוחד. למעלה ממחצית מהאוכלוסייה הם ילדים ובני נוער, ושיעור הילודה גבוה משמעותית מהממוצע הארצי. נתון זה משפיע על אופי החיים בקהילה, על מבנה המשפחה, ועל הצרכים בתחומי חינוך, רווחה ושירותים קהילתיים.'
      }
    },
    { 
      statement: 'ריכוזי האוכלוסייה החרדית נמצאים בעיקר בירושלים, בני ברק, מודיעין עילית, ביתר עילית, אלעד, בית שמש ויישובים נוספים שבהם מהווה האוכלוסייה החרדית רוב או חלק משמעותי מהתושבים.', 
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון. ריכוזי האוכלוסייה החרדית נמצאים בעיקר בירושלים, בני ברק, מודיעין עילית, ביתר עילית, אלעד, בית שמש ויישובים נוספים שבהם מהווה האוכלוסייה החרדית רוב או חלק משמעותי מהתושבים.'
      }
    },
    { 
      statement: 'החיים מתנהלים לרוב במרחב קהילתי צפוף, עם מוסדות חינוך, בתי כנסת ושירותים קהילתיים הנמצאים במרחק הליכה.', 
      correct: 'true',
      feedback: {
        correct: 'נכון! נוסף על כך המשפחה והקהילה מהוות עוגן מרכזי בחיי הפרט..',
        wrong: 'לא נכון.  החיים מתנהלים לרוב במרחב קהילתי צפוף, עם מוסדות חינוך, בתי כנסת ושירותים קהילתיים הנמצאים במרחק הליכה. המשפחה והקהילה מהוות עוגן מרכזי בחיי הפרט .'
      }
    },
    { 
      statement: 'קיימת מערכת ענפה של ערבות הדדית, עזרה פנימית והתנדבות, המופעלת באמצעות מוסדות קהילה, ארגוני חסד והנהגה רוחנית. ', 
      correct: 'true',
      feedback: {
        correct: 'נכון! במקביל, בעשורים האחרונים חלים תהליכי שינוי והשתלבות הדרגתית בתחומי תעסוקה, הכשרה מקצועית ושירותים אזרחיים, תוך ניסיון לשמור על ערכי הקהילה.',
        wrong: 'לא נכון. קיימת מערכת ענפה של ערבות הדדית, עזרה פנימית והתנדבות, המופעלת באמצעות מוסדות קהילה, ארגוני חסד והנהגה רוחנית. במקביל, בעשורים האחרונים חלים תהליכי שינוי והשתלבות הדרגתית בתחומי תעסוקה, הכשרה מקצועית ושירותים אזרחיים, תוך ניסיון לשמור על ערכי הקהילה .'
      }
    },

        { 
      statement: 'כרבע מהחברה החרדית צורכת תקשרות בעיקר דרך העיתונות המודפסת, בעוד שרבע אחר אינו חשוף כלל למידע אינטרנטי ותקשורת חזותית.', 
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון. אכן כרבע מהחברה החרדית צורכת תקשרות בעיקר דרך העיתונות המודפסת, בעוד שרבע אחר אינו חשוף כלל למידע אינטרנטי ותקשורת חזותית.'
      }
    },
        { 
      statement: '62% אחוזים מהחברה החרדית, כשני שליש, משתמשים באינטרנט, כש-37% מדווחים שגולשים באתרים שאינם עוברים את הסינון התורני. ',
      correct: 'true',
      feedback: {
        correct: 'נכון! יחד עם זאת, בניתוח מעמיק מבינים כי מרבית השימוש הוא באי-מייל בלבד או אתרים לצורכי עבודה, כך שבפועל הנתונים הגבוהים אינם משקפים חשיפה מלאה. חשוב לקחת את כל אלה בחשבון כשמחפשים פתרונות להפצת מידע. ',
        wrong: 'לא נכון. אכן 62% אחוזים מהחברה החרדית, כשני שליש, משתמשים באינטרנט, כש-37% מדווחים שגולשים באתרים שאינם עוברים את הסינון התורני יחד עם זאת, בניתוח מעמיק מבינים כי מרבית השימוש הוא באי-מייל בלבד או אתרים לצורכי עבודה, כך שבפועל הנתונים הגבוהים אינם משקפים חשיפה מלאה. חשוב לקחת את כל אלה בחשבון כשמחפשים פתרונות להפצת מידע. '
      }
    },
        { 
      statement: 'קיימת מערכת ענפה של ערבות הדדית, עזרה פנימית והתנדבות, המופעלת באמצעות מוסדות קהילה, ארגוני חסד והנהגה רוחנית. ', 
      correct: 'true',
      feedback: {
        correct: 'נכון! במקביל, בעשורים האחרונים חלים תהליכי שינוי והשתלבות הדרגתית בתחומי תעסוקה, הכשרה מקצועית ושירותים אזרחיים, תוך ניסיון לשמור על ערכי הקהילה.',
        wrong: 'לא נכון. קיימת מערכת ענפה של ערבות הדדית, עזרה פנימית והתנדבות, המופעלת באמצעות מוסדות קהילה, ארגוני חסד והנהגה רוחנית. במקביל, בעשורים האחרונים חלים תהליכי שינוי והשתלבות הדרגתית בתחומי תעסוקה, הכשרה מקצועית ושירותים אזרחיים, תוך ניסיון לשמור על ערכי הקהילה .'
      }
    },
        { 
      statement: 'קיימת מערכת ענפה של ערבות הדדית, עזרה פנימית והתנדבות, המופעלת באמצעות מוסדות קהילה, ארגוני חסד והנהגה רוחנית. ', 
      correct: 'true',
      feedback: {
        correct: 'נכון! במקביל, בעשורים האחרונים חלים תהליכי שינוי והשתלבות הדרגתית בתחומי תעסוקה, הכשרה מקצועית ושירותים אזרחיים, תוך ניסיון לשמור על ערכי הקהילה.',
        wrong: 'לא נכון. קיימת מערכת ענפה של ערבות הדדית, עזרה פנימית והתנדבות, המופעלת באמצעות מוסדות קהילה, ארגוני חסד והנהגה רוחנית. במקביל, בעשורים האחרונים חלים תהליכי שינוי והשתלבות הדרגתית בתחומי תעסוקה, הכשרה מקצועית ושירותים אזרחיים, תוך ניסיון לשמור על ערכי הקהילה .'
      }
    }
  ],

  'החברה הערבית': [
    {
      statement: 'החברה הערבית בישראל מהווה כ־21% מכלל אוכלוסיית המדינה, ומונה למעלה משני מיליון אזרחים.',
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון החברה הערבית בישראל אכן מהווה כ־21% מכלל אוכלוסיית המדינה, ומונה למעלה משני מיליון אזרחים.'
      }
    },
    {
      statement: `מדובר בקבוצה מגוונת הכוללת מוסלמים, נוצרים, דרוזים וקבוצות נוספות, עם מאפיינים תרבותיים, דתיים וחברתיים שונים.`,
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    },
    {
      statement: 'ריכוזי האוכלוסייה הערבית נמצאים בצפון הארץ – בגליל ובמשולש, ביישובים כמו נצרת, אום אל־פחם, שפרעם, טייבה ובאקה־ג’ת, וכן במזרח ירושלים. בנוסף, קיימות ערים מעורבות כגון חיפה, עכו, יפו, רמלה ולוד, שבהן חיים יהודים וערבים זה לצד זה',
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    },
    {
      statement: 'החברה הערבית מתחלקת על פני הארץ -51% אחוזים מתגוררים בצפון הארץ,17% מתגוררים באיזור הנגב וקצת יותר משמונה אחוזים מתגוררים בערים מעורבות (כמו לוד, רמלה, חיפה ועכו).',
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    },
    {
      statement: 'ניתן גם לחלק את האוכלוסייה לפי שיוך דתי:83% מהחברה הערבית הינם מוסלמים, 9% דרוזים ו-8% מהחברה הם נוצרים ',
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    }
  ],

  'מוגבלויות והגיל השלישי': [
    {
      statement: `אנשים עם מוגבלויות והאוכלוסייה בגיל השלישי מהווים יחד חלק משמעותי מהחברה הישראלית.`,
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    },
    {
      statement: ` בישראל חיים למעלה ממיליון אנשים עם מוגבלויות, המהווים כ־10–11% מהאוכלוסייה, כאשר בפועל שיעור האנשים החווים מוגבלות כלשהי במהלך חייהם גבוה אף יותר.`,
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    },
    {
      statement: `האוכלוסייה בגיל 65 ומעלה נמצאת במגמת גידול מתמדת.`,
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    },
    {
      statement: `אנשים עם מוגבלויות כוללים מגוון רחב של מצבים: מוגבלויות פיזיות, חושיות, קוגניטיביות ונפשיות. לכל סוג מוגבלות צרכים שונים, אך המשותף לכולם הוא הצורך בסביבה נגישה, מותאמת ומכילה, המאפשרת השתתפות פעילה בחיים האישיים, החברתיים והקהילתיים.`,
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    },
    {
      statement: `האוכלוסייה המבוגרת בישראל כוללת אנשים עצמאיים ופעילים לצד כאלה הזקוקים לסיוע יומיומי, שירותי בריאות, תרופות וליווי.`,
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    },
    {
      statement: `רבים מהקשישים חיים בגפם, וחלקם תלויים במערכות רווחה, בני משפחה או מטפלים.`,
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    },
    {
      statement: `18% מהאוכלוסייה בישראל הם בני ובנות הגיל השלישי או אנשים עם מוגבלויות. 1 מכל חמישה ישראלים זקוק לסיוע, כש-20% מהם הם ילדים עד גיל 18, מחצית בוגרים בגילאי 18–64, וכמעט שליש בני 65 ומעלה.`,
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    },
    {
      statement: `הנכות השכיחה ביותר שמזכה בקצבה היא נכות נפשית – המהווה כ־37% מכלל סוגי הנכות. `,
      correct: 'true',
      feedback: {
        correct: 'נכון!',
        wrong: 'לא נכון.'
      }
    }
  ]
};

export default trueFalseData;
