const videoData = {
  "החברה החרדית": {
    title: "החברה החרדית",
    imgSrc:`${process.env.PUBLIC_URL}/assets/imgs/cuctuseJPNG/cactusDos.png`,
    videoInfo:`יחידה זו נועדה להסביר על ההבדלים והאתגרים בחברה החרדית, בסיומה, נשאל שאלות להבנה.`,
    videoSrc: `${process.env.PUBLIC_URL}/assets/media/dosVid.mp4`,
    titleContent: "אז מיהו חרדי?",
    textContent: `האם זה מי שלומד או שולח את ילדיו למוסדות חינוך חרדיים? האם זה מי שחרד מהשפעות חיצוניות ומערביות? האם הוא חרד לדבר ה' ומקפיד על 'קלה' כ'בחומרה' רוב הסקרים הנוגעים למגזר החרדי מתבססים על ההגדרה העצמית של האדם, כלומר, "חרדי" הוא מי שמגדיר את עצמו ככזה.`,
    slides: [
      {
        title: "הקדמה:",
        text: `ביחידה זו נעשה לכם סדר בין הזרמים והתפלגות הקבוצות המרכיבים את מה שאנחנו קוראים לו "החברה החרדית". בסופה תכירו את 'הקסם החרדי' ותקבלו המלצות כיצד גם אתם תוכלו לשתף פעולה ולרתום באופן מיטבי מנהיגים וקהילות בחברה החרדית, לשגרה ולשעת חירום.`
      },
      {
        title: "אז מיהו חרדי?",
        text: `האם זה מי שלומד או שולח את ילדיו למוסדות חינוך חרדיים? האם זה מי שחרד מהשפעות חיצוניות ומערביות? האם הוא חרד לדבר ה' ומקפיד על 'קלה' כ'בחומרה' רוב הסקרים הנוגעים למגזר החרדי מתבססים על ההגדרה העצמית של האדם, כלומר, "חרדי" הוא מי שמגדיר את עצמו ככזה.`
      }
    ],
    questions:[
      {
        question: "מהו שינוי מרכזי שחלים בו מגמות בחברה החרדית בשנים האחרונות?",
        answer1: "א. ירידה חדה במספר הנשים העובדות",
        answer2: "ב. עלייה בשיעור השימוש המלא באינטרנט ללא סינון",
        answer3: "ג. ירידה מתונה בילודה ועלייה בשיעור היציאה לעבודה",
        answer4: "ד. נטישת מוסדות החינוך החרדיים לטובת חינוך ממלכתי",
        correctAns: "ג. ירידה מתונה בילודה ועלייה בשיעור היציאה לעבודה",
      },
      {
        question: "איזו קבוצה נחשבת לכזו שמתפקדת כ'זרוע ביצועית' בחברה החרדית?",
        answer1: "א. מועצת גדולי התורה",
        answer2: "ב. אנשי החצר / העסקנים הקהילתיים",
        answer3: "ג. הפלג הירושלמי",
        answer4: "ד. מועצת הרבנות הראשית",
        correctAns: "ב. אנשי החצר / העסקנים הקהילתיים",
      },
      {
        question: "מהו אתגר חשוב שיש לקחת בחשבון בעבודה מול הקהילה החרדית בשעת חירום?",
        answer1:  "א. הוראות הרבנים עלולות לא להתיישר עם הנחיות פיקוד העורף",
        answer2:"ב. חוסר גישה למזון בסיסי",
        answer3: "ג. מחסור בקווי תקשורת",
        answer4: "ד. העדפה לשירות צבאי מלא",
        correctAns: "א. הוראות הרבנים עלולות לא להתיישר עם הנחיות פיקוד העורף",
      },
      {
        question: "מה מאפיין את המבנה ההיררכי בחברה החרדית?",
        answer1: "א. כל קהילה מתנהלת באופן עצמאי וללא הנהגה ברורה",
        answer2: "ב. הנהגה דמוקרטית הנשענת על בחירות פנימיות",
        answer3: "ג. מערכת ניהול שטוחה עם שוויון מגדרי",
        answer4:  "ד. רבנים ואדמו\"רים מובילים את כל תחומי החיים ומתווים את הדרך",
        correctAns:  "ד. רבנים ואדמו\"רים מובילים את כל תחומי החיים ומתווים את הדרך",
      },
      {
        question: "מהו המסר המרכזי בחשיבה על שיתוף פעולה עם הקהילה החרדית?",
        answer1: "א. יש לפעול מעל ראשם של הרבנים כדי לקדם שינויים",
        answer2: "ב. יש להציע מודל אחיד לכולם כדי ליצור שוויון",
        answer3: "ג. יש להתאים את הפעולה לערכי הקהילה, לפעול מתוך הקשבה, אמון ורתימה",
        answer4: "ד. חשוב להדגיש את הבדלנות של החברה החרדית כדי למנוע התנגשות",
        correctAns: "ג. יש להתאים את הפעולה לערכי הקהילה, לפעול מתוך הקשבה, אמון ורתימה",
      },
    ]

  },
  "החברה הערבית": {
    title: "החברה הערבית",     
     imgSrc:`${process.env.PUBLIC_URL}/assets/imgs/cuctuseJPNG/cactusArab.png`,
     videoInfo:`יחידה זו נועדה להסביר על ההבדלים והאתגרים בחברה הערבית, בסיומה, נשאל שאלות להבנה.`,
    videoSrc: `${process.env.PUBLIC_URL}/assets/media/arabVid.mp4`,
    titleContent: "הקדמה:",
    textContent: `ביחידה זו נעשה לכם סדר בתוך המאפיינים וגורמי ההשפעה המרכיבים את מה שאנחנו קוראים "החברה הערבית". בסופה תקבלו המלצות כיצד גם אתם תוכלו לשתף פעולה ולרתום באופן מיטבי מנהיגים וקהילות בחברה הערבית - לשגרה ולשעת חירום.`,
    questions : [
      {
        question: "מהו אחד המאפיינים הבולטים של החברה הערבית בישראל בעת האחרונה, לצד הקשיים הכלכליים והתעסוקתיים?",
        answer1: "א. העמקה של הפערים בין גברים לנשים",
        answer2: "ב. צמיחת מעמד ביניים חדש",
        answer3: "ג. התחזקות המגזר החקלאי",
        answer4: "ד. מעבר המוני לערים יהודיות",
        correctAns: "ב. צמיחת מעמד ביניים חדש",
      },
      {
        question: "כיצד נתפסת מערכת היחסים של החברה הערבית עם השלטון בישראל בעת מלחמה?",
        answer1: "א. מערכת יחסים מורכבת, עם שילוב של חשדנות ושותפות נקודתית",
        answer2: "ב. מערכת יחסים אדישה אך משתפת פעולה",
        answer3: "ג. מערכת יחסים שמבוססת רק על הנהגה דתית",
        answer4: "ד. מערכת יחסים יציבה ומלאת אמון",
        correctAns: "א. מערכת יחסים מורכבת, עם שילוב של חשדנות ושותפות נקודתית",
      },
      {
        question: "מהי אחת הדרכים המרכזיות שהוצעו לחיזוק הקשר בין פיקוד העורף לחברה הערבית?",
        answer1: "א. ריכוז ההנחיות רק בעברית כדי לעודד אינטגרציה",
        answer2: "ב. הפסקת שיתוף הפעולה עם הנהגות מקומיות",
        answer3: "ג. חיזוק קהילת החירום המקומית ושילוב משפיעים מקומיים",
        answer4: "ד. עידוד עזיבת החברה הערבית את הערים המעורבות",
        correctAns: "ג. חיזוק קהילת החירום המקומית ושילוב משפיעים מקומיים",
      },
      {
        question: "מה מבטא השילוב של חוסר אונים עם תחושת מסוגלות ואופטימיות בחברה הערבית בזמן מלחמה?",
        answer1: "א. קונפליקט בין הנהגות דתיות לחילוניות",
        answer2: "ב. סתירה שמקשה על תפקוד",
        answer3: "ג. תוצאה של מידע כוזב שמוזן מערוצי תקשורת זרים",
        answer4: "ד. מורכבות רגשית המבטאת רצון להשתלב אך גם תחושת ניתוק",
        correctAns: "ד. מורכבות רגשית המבטאת רצון להשתלב אך גם תחושת ניתוק",
      },
      {
        question: "כיצד ניתן לסכם את ההמלצות לשיפור שיתוף הפעולה עם החברה הערבית?",
        answer1: "א. חיזוק הכוחות הביטחוניים ברחוב הערבי",
        answer2: "ב. יצירת שיתופי פעולה מקומיים, תגבור הדרכות והסברה מותאמת",
        answer3: "ג. הפחתת נראות של גופים צבאיים וניתוק תקשורתי יזום",
        answer4: "ד. ריכוז הפעילות ברמה הממשלתית בלבד",
        correctAns: "ב. יצירת שיתופי פעולה מקומיים, תגבור הדרכות והסברה מותאמת",
      },
    ]

  },
  "מוגבלויות והגיל השלישי": {
    title: "מוגבלויות והגיל השלישי",
    imgSrc:`${process.env.PUBLIC_URL}/assets/imgs/cuctuseJPNG/cactusOld.png`,
    videoInfo:` יחידה זו נועדה להסביר על ההבדלים והאתגרים לגיל השלישי ואוכלוסיה עם מוגבלויות, בסיומה, נשאל שאלות להבנה.`,

    videoSrc: `${process.env.PUBLIC_URL}/assets/media/oldVid.mp4`,
    titleContent: "הקדמה:",
    textContent: `ביחידה זו נעשה סדר במונחים, נבין את המאפיינים והאתגרים, וניתן דגשים פרקטיים לשיתופי פעולה – בשגרה בשעת חירום`,
    questions:[
      {
        question: "מהו אחד האתגרים המרכזיים בהתמודדות עם אנשים המתניידים בכיסאות גלגלים בשעת חירום?",
        answer1: "א. תכנון לקוי מראש של נגישות ותנאי פינוי",
        answer2: "ב. קושי באיתורם בתוך קהל גדול",
        answer3: "ג. צורך בשמירה רפואית צמודה",
        answer4: "ד. היעדר הבנה של שפת סימנים",
        correctAns: "א. תכנון לקוי מראש של נגישות ותנאי פינוי",
      },
      {
        question: "מדוע חשוב לנתח את הפניות למוקד 106 בעת חירום?",
        answer1: "א. כדי לזהות עומסים טכנולוגיים במוקד",
        answer2: "ב. כדי להבין צרכים חוזרים של אוכלוסיות רגישות ולזהות מגמות",
        answer3: "ג. כדי לאבחן תקלות ברשת התקשורת",
        answer4: "ד. כדי לנתב את הפניות למוקד הארצי",
        correctAns: "ב. כדי להבין צרכים חוזרים של אוכלוסיות רגישות ולזהות מגמות",
      },
      {
        question: "מהו עיקרון מרכזי בתקשורת עם אדם עם מוגבלות שכלית-התפתחותית?",
        answer1: "א. להשתמש במונחים מקצועיים כדי להעלות את רמת השיח",
        answer2: "ב. לדבר בקצב מהיר כדי לשמור על ריכוז",
        answer3: "ג. להשתמש בשפה פשוטה, משפטים קצרים ומידע ממוקד",
        answer4: "ד. להיעזר במתווך בלבד, ולא לפנות לאדם עצמו",
        correctAns: "א. להשתמש בשפה פשוטה, משפטים קצרים ומידע ממוקד",
      },
      {
        question: "מהו נוהל \"כספת נצורה\"?",
        answer1: "א. תהליך לאיתור אזרחים וותיקים עריריים שאינם מטופלים ברווחה",
        answer2: "ב. נוהל להעברת כספים לרשויות בשעת חירום",
        answer3: "ג. קוד להפעלת מקלטי חירום לאנשים עם מוגבלות",
        answer4: "ד. מערכת נעילה בטיחותית למוסדות סיעודיים",
        correctAns: "א. תהליך לאיתור אזרחים וותיקים עריריים שאינם מטופלים ברווחה",
      },
      {
        question: "מדוע חשוב שצוותים ידברו בגובה העיניים עם אנשים עם מוגבלויות?",
        answer1: "א. כדי למנוע ויכוחים עם בני המשפחה",
        answer2: "ב. כדי לשמור על אווירה מקצועית",
        answer3: "ג. כדי לעקוף את החסמים הבירוקרטיים",
        answer4: "ד. כדי לייצר שיתוף פעולה ואמון",
        correctAns: "ד. כדי לייצר שיתוף פעולה ואמון",
      },
    ]

  },
};

export default videoData;